## Plan Result (sbox_landing - TerraformPlanApply)




<pre><code>Plan: 1 to add, 19 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace_aad_admin.aad
* Update
  * module.logic[&#34;00&#34;].azurerm_storage_account.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-MoJ-RDP-Inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_synapse_workspace_aad_admin.aad will be created
  + resource "azurerm_synapse_workspace_aad_admin" "aad" {
      + id                   = (known after apply)
      + login                = "DTS Platform Operations"
      + object_id            = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + synapse_workspace_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox"
      + tenant_id            = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.logic["00"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Storage/storageAccounts/ingest00logicsbox"
        name                               = "ingest00logicsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_network_security_rule.rules["nsg-Allow-MoJ-RDP-Inbound"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "rules" {
        id                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/networkSecurityGroups/ingest00-nsg-sbox/securityRules/nsg-Allow-MoJ-RDP-Inbound"
        name                                       = "nsg-Allow-MoJ-RDP-Inbound"
      ~ source_address_prefixes                    = [
          - "51.149.249.36",
            # (4 unchanged elements hidden)
        ]
        # (16 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-private-sbox"
        name                                          = "ingest00-data-bricks-private-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-private-sbox"
        name                                          = "ingest00-data-bricks-product-private-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-product-public-sbox"
        name                                          = "ingest00-data-bricks-product-public-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-bricks-public-sbox"
        name                                          = "ingest00-data-bricks-public-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-integration-001-sbox"
        name                                          = "ingest00-data-integration-001-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-integration-002-sbox"
        name                                          = "ingest00-data-integration-002-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox"
        name                                          = "ingest00-data-product-001-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-002-sbox"
        name                                          = "ingest00-data-product-002-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-gh-runners"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-gh-runners-sbox"
        name                                          = "ingest00-gh-runners-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
        name                                          = "ingest00-services-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services-mysql"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-mysql-sbox"
        name                                          = "ingest00-services-mysql-sbox"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
        name                               = "ingest00curatedsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
        name                               = "ingest00externalsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00landingsbox"
        name                               = "ingest00landingsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
        name                               = "ingest00rawsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
        name                               = "ingest00workspacesbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-sbox"
        name                                              = "ingest00-shir001-vmss-sbox"
        tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (33 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 19 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":50,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->